// 空のC#スクリプト

// 所定のタイミングで実行するため、Update(),OnGUI()等は無効化してあるので注意

using UnityEngine;

// 「クラス名=ファイル名=マシン名(の一部)」を推奨
// UserScriptを継承する必要がある
public class MachineName : UserScript
{
	//----------------------------------------------------------------------------------------------
	// ユーザー名取得(プレイヤー名と一致しなければ動作しない)
	// ※(危険な)スクリプト配布を抑制するための暫定措置
	//----------------------------------------------------------------------------------------------
	public override string GetUserName()
	{
		return "UserName";
	}

	//----------------------------------------------------------------------------------------------
	// 開始処理(マシン出現時に1回実行)
	//----------------------------------------------------------------------------------------------
	public override void OnStart(AutoPilot ap)
	{
		ap.Log("OnStart:" + Time.frameCount);
	}

	//----------------------------------------------------------------------------------------------
	// 更新処理(処理落ちしていなければ1/60秒に1回実行)
	//----------------------------------------------------------------------------------------------
	public override void OnUpdate(AutoPilot ap)
	{
		ap.Print(0, "OnUpdate:" + Time.frameCount);
	}
}
